{
  "key": [
    {
      "id": "000",
      "query": "",
      "title": "",
      "description": "",
      "date": "",
      "article_image": "",
      "keywords": [],
      "published_time": "",
      "modified_time": "",
      "featured": true,
      "vibe_audio": "",
      "body_1": "",
      "image_1": "",
      "video_1": "",
      "body_2": "",
      "image_2": "",
      "video_2": "",
      "body_3": "",
      "video_4": "",
      "body_4": ""
    }
  ],
  "posts": [
    {
      "id": "001",
      "query": "hello-world",
      "date": "27 Jun 2024",
      "title": "Hello World: Starting a Blog, Next.JS, and AWS Amplify",
      "description": "Welcome to my blog! In this first post, I share my journey of starting a blog using Next.js and AWS Amplify. I discuss the robust features of Next.js, the ease of hosting with AWS Amplify, and my plans for future enhancements like adding a database. Join me as I dive deep into these technologies and share my learnings as a developer.",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/wiz-oz.png",
      "keywords": ["Dev", "Next.js", "AWS Amplify", "Dynamic Routing"],
      "published_time": "2024-06-27T16:24:36Z",
      "modified_time": "2024-06-27T16:24:36Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/hello.mp3",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/hello-world.png",
      "body_1": "Welcome to my blog, my friends, DEVs, and randos from the interwebs! This is my first post, and I'm excited to share, well... whatever this is with you. I&apos;ve decided to start this blog as a way to improve my skills in Next.js and Amazon Web Services (AWS). These technologies are not only powerful but also offer exciting opportunities for future projects and career growth. To be quite honest, it has been such a learning experience, and I&apos;ve had a great time building it. I&apos;ve also just been looking for a place to try out some different things. After my <a href='https://www.youtube.com/@YourDadSucksGaming' target='_blank'>failed attempt to be a video game YouTuber</a>. I figured blogging might be fun, and maybe not so embarrassing... but it will probably turn out to be as embarrassing. Hopefully you enjoy this journey with me as much as I enjoyed building it. </br></br> <h2>Why Next.js and AWS Amplify?</h2></br> I chose Next.js for its honestly bad ass features and flexibility, especially when it comes to server-side rendering and static site generation. I&apos;ve messed around with Next.js a bit, but this gives me an excuse to dive deeper into it. AWS Amplify, on the other hand, makes hosting and managing this site surprisingly easy. One of the coolest features is the seamless integration with GitHub. Every time I update my repository, the changes are automatically deployed to my site! Coming from PHP and Apache servers at my job, this is seriously a breath of fresh air. Because of this, I&apos;m currently using JSON file to render all of this information to you. The goal is to ultimately add a database, but in due time.",
      "body_2": "<h2>Dynamic Routing and Other Issues</h2></br><h4 >Warning: DEV jargon ahead</h4></br>One of the significant hurdles was figuring out dynamic routing. Initially, I tried using query strings in the URL to render this very blog page. This method worked fine with Vercel hosting, but I encountered issues when switching to AWS. After some trial and error, I managed to implement <a href='https://nextjs.org/docs/pages/building-your-application/routing/dynamic-routes' target='_blank'>dynamic routing</a>, and everything started coming together. I love how clean the URL looks now. Just look at it: <em>https://latestartdev.com/posts/hello-world</em>. Compared to query strings, you wouldn't even know this URL is dynamic!</br></br>Another challenge was dynamically rendering metadata for each blog post. Ensuring that each page had the correct metadata for SEO purposes was tricky but essential. Using the Link tag that Next.js provides out of the box passes parameters so easily. I created a dynamic page and was able to create dynamic URLs using template literals in the `src` part of the Link tag. I'm getting into the weeds here, so I'll probably dedicate a whole post to this topic.</br></br>I also found the Next.js Image tag to be a bit confusing... even still. It's a powerful tool for optimizing images, but getting the configuration right took some time and experimentation. I am using an out-of-date method called <em>&apos;layout&apos;</em>. When I use <em>layout=&quot;responsive&quot;</em>, the image just works. Out of frustration, I have decided to just use this method. Why Next.js?? Why are you taking away this great feature!",
      "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/well-waiting.png",
      "body_3": "<h2>What’s Next... js?</h2></br>Looking ahead, my next step is to connect the blog to a database. I'm planning to use Amazon DynamoDB to keep everything within the AWS ecosystem. This will allow me to manage and serve blog posts more efficiently.</br></br>Through this blog, I’ll be sharing my learnings as a developer, and tips and tricks I pick up along the way, and whatever else I feel like. Whether you're just starting your journey in the tech world or you're changing your career, or whatever, I hope my experiences can provide some value. Starting something new can be daunting, but when things start to come together, there's no better feeling. I'm looking forward to exploring creative ways to create posts and sharing my progress.</br></br>You still there? Didn’t think so…. You were never there anyways…. Stay tuned for more updates!"
    },
    {
      "id": "002",
      "query": "hive-mind",
      "title": "Is That a Hive Mind, or are You Just Happy to See Me...",
      "description": "Hive mentality, also known as groupthink, is a phenomenon where individuals follow group decision-making, often losing personal autonomy. This concept is famously explored in the classic sci-fi film The Invasion of the Body Snatchers. Explore how hive mentality affects our daily lives and whether it can lead to positive collective changes, such as the growing trend of non-alcoholic options in the restaurant industry. Dive into the balance between individual choice and group influence, and reflect on whether we are all part of a hive mind.",
      "date": "1 Jul 2024",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/Hive-mind-main.png",
      "keywords": [
        "Mocktail trend",
        "Groupthink",
        "Collective consciousness",
        "Invasion of the Body Snatchers",
        "Health consciousness",
        "Social influence"
      ],
      "published_time": "2024-07-01T13:28:51Z",
      "modified_time": "2024-07-01T13:28:51Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/hive-mind.mp3",
      "body_1": " <q>I keep seeing these people, all recognizing each other. Something is passing between them all, some secret. It is a conspiracy, I know it</q></br></br>Hive mentality, also known as groupthink, is when people have a strong tendency to conform to group decision-making. This mentality can lead to feelings of invulnerability and moral superiority within the group, potentially causing individuals to lose their free will and become controlled by external influences. But is the concept of a Hive Mind merely fictional? </br></br>This phenomenon has been explored in various cultural contexts, most famously for me is in the classic sci-fi film <em><a href='https://en.wikipedia.org/wiki/Invasion_of_the_Body_Snatchers_(1978_film)' target='_blank'>The Invasion of the Body Snatchers.</a></em> This film features alien plant spores that duplicate and replace humans, creating a collective consciousness. This film captures the fear and intrigue surrounding the loss of individual identity to a hive mind.</br></br>Do you ever feel like you might be a part of a hive mind mentality? Maybe the feeling comes from subconscious influences that we&apos;re not always aware of.</br></br> Let me give you an example from my own life. Recently, I've been focusing more on my health and wellbeing, which includes not drinking alcohol. Having worked in restaurants for most of my life until a few years ago, I&apos;ve noticed a shift in the industry that I hadn't seen before. Mocktail menus and non-alcoholic (NA) options are now more prevalent than ever. Sure, there were always a few token options like O&apos;Douls, but now there's a real variety available. ",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/Beer-drink.png",
      "body_2": "This shift got me thinking: Is this change driven by a genuine increase in health consciousness, or is it another example of hive mentality? In this case, it feels like the hive mentality is for the better. There's a wave of ideas that people are making their lives better with alternative choices. Whether it's adopting healthier habits, being more mindful of mental wellbeing, or making more sustainable choices, these collective movements can lead to significant positive impacts on society. </br></br>Or maybe this is the THC talking… I have been partaking in a little of that during my &apos;no drinking era&apos;. <a href='https://www.lrl.mn.gov/guides/guides?issue=cannabis' target='_blank'>In 2023, Minnesota legalized recreational marijuana for use by adults.</a> </br></br>We often think of hive mentality as something negative, a loss of individuality. But sometimes, it can propel us toward collective improvements that might be harder to achieve alone. It&apos;s an interesting balance between individual choice and group influence, and it&apos;s something worth pondering as we navigate our personal and social lives."
    },
    {
      "id": "003",
      "query": "query-vs-dynamic",
      "title": "Do You Even Dynamic Link Bro?",
      "description": "Explore the differences between query stringing and dynamic linking in Next.js. Learn about the challenges with query stringing in React and Apache servers, and discover the benefits of dynamic linking for cleaner, SEO-friendly URLs and simplified navigation",
      "date": "14 Jul 2024",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/render.png",
      "keywords": [
        "Dev",
        "Next.js",
        "Dynamic Linking",
        "Query Stringing",
        "Vercel"
      ],
      "published_time": "2024-07-14T19:08:26Z",
      "modified_time": "2024-07-14T19:08:26Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/workitout.mp3",
      "body_1": "I was working on a few projects where I wanted to have content render to a page using query stringing. Query strings are a straightforward way to pass parameters in URLs. They are appended to the URL after a question mark (?), with key-value pairs separated by an ampersand (&). For example: <code>https://latestartdev.com/page?param1=value1&amp;param2=value2</code> </br></br>For my personal projects, I was using c-panel and hosting through Hostgator. For work, our web server is built with Apache. I would build the application locally, and everything would work the way I&apos;d expect it to work with info rendering nicely using query stringing. And then, when I&apos;d serve it up through one of the aforementioned servers, any time I&apos;d refresh the page populated from the query string, the page would just break. So frustrating! I have zero experience with setting up either server, so I didn&apos;t really know what to do.",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/theproblem.png",
      "body_2": "I decided to pivot and loaded one of my projects to <a href='https://vercel.com/' target='_blank'>Vercel</a>. And it just worked! Not only that, but I didn&apos;t have to have my app go through a static build and upload a folder with random files to a server. Instead, I just needed to create a repository in GitHub for my project, connect it to Vercel, and every time I saved my project on VS Code, all the updates would go live directly to my website! I still love how easy that process is.</br></br>While I got a project up and running hosting through Vercel, I was learning a lot about Next.js. It&apos;s how I heard about Vercel in the first place as they are the company that created Next.js. As I&apos;m learning about things, I came across Dynamic linking. Whaaa?… It&apos;s query stringing without stringing anything to the URL… looks so clean! In fact it is what I'm using for the page you are currently reading!",
      "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/dynamicnow.png",
      "body_3": "<h2>Let’s Talk About Dynamic Routes in Next.js</h2></br>When building web applications, dynamically rendering pages based on URL parameters is a common requirement. Next.js simplifies this process with dynamic routes. Here's how you can effectively create and use dynamic routes by creating a simple list using map, and making those list item link to pages using dynamic linking:</br></br><h4>1. Create a New Next.js Project</h4>Start by setting up a new Next.js project. Be sure to set up your app with App Router.</br></br><h4>2.Set Up Folder and Dynamic Routing  </h4>In your Next.js project, create a folder structure and utilize dynamic routing. For example:</br> <code></br>app</br>|__page.jsx</br>|__posts.json</br>|__[postSlug] </br> &nbsp; &nbsp; &nbsp;|__ page.jsx</code></br></br>Take note of the folder named [postSlug]. To make the URL dynamic, it's essential to have the folder name surrounded by brackets like above. </br></br><h4>3. Create a JSON File for Data</h4> Begin with a JSON file (posts.json) containing objects with titles and corresponding query parameters:</br></br><code>posts.json - </br></br>'posts': [ {</br>title:'My First Post',</br>query:'first-post'</br>},</br> {</br>title:'My Second Post',</br>query:'second-post'</br>}</code></br></br> <h4>4.Implement Dynamic Linking </h4> In your app/page.jsx file, map through the objects in posts.json and use Next.js &lt;Link&gt; component to dynamically link to each post: </br></br> <code> import Posts from './posts.json'; </br></br> Posts.posts.map( item =&gt; { </br> return ( &lt;div key=&#123;item.id&#125;&gt; &lt;Link href=&#123;`demo/${item.query}`&#125;&gt;&#123;item.title&#125;&lt;/Link&gt; &lt;/div&gt; );</br>})]</code></br></br><h4>5. Implement Dynamic Linking</h4> In your [query]/page.jsx file, retrieve the query parameter from the URL:</br></br><code>import Posts from &quot;../posts.json&quot;;</br></br>const page = (&#123;params&#125;) =&gt; &#123;</br>&nbsp;&nbsp;const queryString = params.render;</br>&nbsp;&nbsp;console.log(queryString);</br>&nbsp;&nbsp;const foundPost = Posts.posts.find((item) =&gt; item.query === queryString);</br>&nbsp;&nbsp;return (</br>&nbsp;&nbsp;&nbsp;&nbsp;&lt;&gt;</br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;h1&gt;&#123;foundPost.title&#125;&lt;/h1&gt;</br>&nbsp;&nbsp;&nbsp;&nbsp;&lt;/&gt;</br>&nbsp;&nbsp;);</br>&#125;; </code></br></br> Following the above we are rendering out the 'title' key value pair that is connected to the 'query' field on our JSON file using the file method.</br></br>I found this video that I thought was very helpful: <a href='https://www.youtube.com/watch?v=ec3OEG8DXJM&list=LL&index=4&t=1978s' target='_blank'> YOUTUBE VIDEO </a>. Check it out if you are looking for something a little more in-depth.</br></br>Dynamic routes in Next.js offer a robust mechanism for creating flexible and SEO-friendly web applications. By leveraging dynamic segments, accessing URL parameters, and seamlessly linking between pages, developers can enhance user experiences and streamline development. Whether you're building a blog, e-commerce site, or any dynamic application, Next.js' dynamic routing capabilities provide powerful solutions to meet your needs. Explore, experiment, and harness the full potential of Next.js for your projects. I hope this guide proves helpful to you!"
    },
    {
      "id": "004",
      "query": "shelley-duvall",
      "title": "Shelley, Darling, Light of my Life...",
      "description": "Reflecting on Shelley Duvall’s legacy, let's explore her complex performance in ’The Shining,’ her experience on set with Stanley Kubrick, and  acknowledging the depth and dedication behind her performances... or not?",
      "date": "16 Jul 2024",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/Duvall-cover.png",
      "keywords": [
        "Shelley Duvall tribute",
        "Shelley Duvall",
        "The Shining",
        "Stanley Kubrick",
        "film performance analysis",
        "Olive Oyl"
      ],
      "published_time": "2024-07-16T13:52:16Z",
      "modified_time": "2024-07-16T13:52:16Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/shinning-intro.mp3",
      "body_1": "<h2>Shelley Duvall: A Retrospective on Her Unique Legacy</h2></br>Shelley Duvall’s passing on July 11, 2024, marks the end of an era for a unique actress. Best known to me for her role as Wendy Torrance in Stanley Kubrick’s ‘The Shining,’ Duvall left an indelible mark on cinema. As I am someone who considers 'The Shining' a favorite movie, I wanted to take a moment to reflect on her work and the impact she had on me as a viewer.</br></br> <h2>The Shining: A Complex Performance</h2></br>When I watched ‘The Shining,’ I struggled with Shelley Duvall’s portrayal of Wendy Torrance. Her expressions and reactions, notably during the iconic elevator scene where blood spills out from the doors, felt over the top and pulled me out of the moment. Her exaggerated fear and hysteria seemed too much, detracting from the chilling atmosphere Kubrick masterfully created. This detraction occurred several times for me throughout her performance in the film.",
      "video_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/video/shelley-blood.mp4",
      "body_2": "I don’t think I am alone in this criticism. Shelley was even nominated for a Razzie award for her performance in the film,  <a href='https: //movieweb.com/shelley-duvall-razzie-rescinded/' target='_blank'>although the parody award show later rescinded that nomination. </a> Over time, I thought it might be time for me to reconsider my initial judgment as well.</br></br>With repeated viewings, I started to see the nuance, and wondered if this performance was intentionally... annoying. Wendy Torrance is a woman with good intentions, caught in a terrifying and surreal situation. Wendy was a former prom queen in the novel, this version of Wendy we can safely assume was not. Her seemingly irritating and overly dramatic demeanor highlights the claustrophobic tension of being trapped in the Overlook Hotel with an increasingly unhinged husband and a son who talks to his finger. Duvall’s portrayal, which initially felt grating, started to make sense within the context of the story. She embodied a character who is not just a victim but a catalyst in Jack Torrance’s descent into madness. You begin to understand, and perhaps empathize, a bit more with why Jack goes down the path that he does—just look at who he has to spend his time with stranded on a mountain!",
      "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/danny-deadpeople.png",
      "body_3": "<h2>Challenges on The Shining Set</h2></br>Duvall’s experience on the set of ‘The Shining’ was infamously grueling. Stanley Kubrick was notorious for his demanding and meticulous nature, and Duvall faced his relentless intensity head-on. She was subjected to extreme stress, with Kubrick insisting on numerous retakes to capture the perfect level of hysteria. This process took a significant toll on her both physically and mentally. In later interviews, Duvall described the experience as almost unbearable, yet she retained a certain respect for Kubrick’s vision and the cinematic masterpiece they created together. Personally, I can see how the line between the actor and the character blurred in this particular situation. I clipped together some of <a href='https://www.youtube.com/watch?v=OukJ7jR4CaM&t=810s' target='_blank'> Vivian Kubrick's documentary</a> that shows how life was for Shelley on set. I get the impression that her behavior was hard to tolerate and not always taken very seriously.",
      "video_4": "https://latestartbucket.s3.us-east-2.amazonaws.com/video/shelley-clip.mp4",
      "body_4": "<h2>Olive Oyl: Perfect Casting</h2></br>On a lighter note, Shelley Duvall’s role as Olive Oyl in <a href='https://www.imdb.com/title/tt0081353/?ref_=tt_ch' target='_blank'> Robert Altman’s ‘Popeye’</a> stands out to me as one of the most perfectly cast roles in film history. Her lanky frame, quirky mannerisms, and distinctive voice brought the beloved cartoon character to life in a way that no other actress could have. It’s a performance that is both charming and unforgettable, proving that Duvall had a remarkable range as an actress.</br></br>Shelley Duvall’s legacy is one of complexity and contradiction. While I might not have been the biggest fan of her work initially, and honestly, I'm still not sure I enjoy it, I can appreciate the dedication and resilience it took to deliver such performances, particularly under the immense pressure from a director like Kubrick. Her performances can be polarizing, but they are undeniably impactful. She brought a unique energy and authenticity to her roles, from the terrified wife in 'The Shining' to the whimsical Olive Oyl. As we reflect on her career and the challenges she faced, it’s clear that Duvall’s contributions to cinema are significant and enduring. Rest in peace, Shelley Duvall. Your talent and spirit will be missed."
    },
    {
      "id": "005",
      "query": "graphql-project",
      "title": "Build a Continent/Country Selector with GraphQL and React",
      "description": "In this tutorial, we'll walk through the process of building a simple React app that allows users to select a continent from a dropdown menu and display the corresponding countries in that continent. We will use Vite, a fast frontend build tool, to set up our React project. Additionally, we'll leverage GraphQL to fetch the data dynamically, making our app flexible and efficient.",
      "date": "23 Aug 2024",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/graphql-cover.png",
      "keywords": ["Dev", "GraphQL", "Vite"],
      "published_time": "2024-08-23T21:03:08Z",
      "modified_time": "2024-08-23T21:03:08Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/ping-Island.mp3",
      "body_1": "I have been learning how to use <strong>GraphQL</strong> to link my applications to a database. I found <a href='https://www.youtube.com/watch?v=0ZJI4cBS4JM&t=772s' target='_blank'>this tutorial</a> by Web Dev Simplified, but some of the content was outdated. So I did some research and from that tutorial, I created this one. In this tutorial, we'll walk through the process of building a simple React app that allows users to select a continent from a dropdown menu and display the corresponding countries in that continent. We will use Vite, a fast frontend build tool, to set up our React project. Additionally, we'll leverage GraphQL to fetch the data dynamically, making our app flexible and efficient.<h2>Step 1: Setting Up the React Project with Vite</h2>First, let's create a new React project using Vite: <br><code>npm create vite@latest continent-country-selector<br>cd continent-country-selector </br> npm install </br> npm run dev</code></br>This command initializes a new React project with Vite and starts the development server. Vite provides a faster, more efficient development experience compared to traditional tools like Create React App.</br></br><h2>Step 2: Structuring the App Component</h2>Let's start by setting up the basic structure of our App.jsx component. This component will manage the state for continents, selected continent, countries, and visibility.<br><br><iframe src='https://www.thiscodeworks.com/embed/66c6573de0e1df0014e8d848' style='width: 100%; height: 346px;' frameborder='0'></iframe><br><br> <h2>Step 3: Fetching Data from the GraphQL API</h2> We'll use the <strong>fetch API</strong> to send GraphQL queries to an endpoint that provides information about continents and countries. The API we'll use is hosted at <em>https://countries.trevorblades.com/</em>. <br><br>Let's create a reusable fetchGraphQL function that handles sending queries to the API:<br><iframe src='https://www.thiscodeworks.com/embed/66c8c340e32d310014d3f324' style='width: 100%; height: 216px;' frameborder='0'></iframe><br><br><h2>Step 4: Fetching and Displaying Continents</h2>We need to fetch the list of continents when the component mounts. We'll use the useEffect hook for this, and store the continents in the continents state. Update the useEffect hook to fetch continents:<br> <iframe src='https://www.thiscodeworks.com/embed/66c8c408e32d310014d3f454' style='width: 100%; height: 242px;' frameborder='0'></iframe><br><br>Now, we can render the continents in the dropdown menu:<br><iframe src='https://www.thiscodeworks.com/embed/66c8c4a9e32d310014d3f583' style='width: 100%; height: 190px;' frameborder='0'></iframe><br><br><h2>Step 5: Fetching and Displaying Countries</h2> Next, we'll fetch the countries of the selected continent when the user selects a continent from the dropdown.<br>Add the following useEffect hook:<br><iframe src='https://www.thiscodeworks.com/embed/66c8c554e32d310014d3f854' style='width: 100%; height: 372px;' frameborder='0'></iframe><br><br> This hook will fetch the countries based on the selected continent code (inputValue) and store them in the countries state. Finally, let's display the countries below the dropdown: <br><iframe src='https://www.thiscodeworks.com/embed/66c8c612e32d310014d3fa63' style='width: 100%; height: 268px;' frameborder='0'></iframe> <br><br> In this tutorial, we've built a simple React app using Vite that allows users to select a continent and view the corresponding countries. We used the fetch API to send GraphQL queries to a remote server, dynamically updating our UI based on user input. Vite's fast development server and optimized build process make it an excellent choice for modern React development. I hope this guide has helped you understand how to work with GraphQL in a React environment using Vite. Happy coding!<br><br><a href='https://gist.github.com/egnica/1a3ec63e61999ef94fb1265ca50b551b' target='_blank'/> Here is a link to the full project code </a>",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/graphql-app.gif"
    },
    {
      "id": "006",
      "query": "different-servers",
      "title": "Who's Serving Who? The Code vs. The Machine",
      "description": "Unravel the confusion around servers in web development. Discover the difference between physical and software servers, with humorous analogies and practical insights. Perfect for developers curious about how servers truly work.",
      "date": "06 Sep 2024",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/aretha.png",
      "keywords": [
        "Dev",
        "Web development servers",
        "Physical vs software servers",
        "Server types in web development",
        "Server confusion in web development"
      ],
      "published_time": "2024-09-06T14:03:31Z",
      "modified_time": "2024-09-06T14:03:31Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/Zoomin-Who.m4a",
      "body_1": "As a web developer, you often come across the word <strong><a href='https://www.youtube.com/watch?v=Fxr9YZB4lHQ' target='_blank'>server</a></strong>, and it can mean different things depending on the context. This can sometimes be confusing. Like Abbott and Costello asking, 'Who’s on first?' or Aretha Franklin wondering, 'Who’s Zoomin' Who?' we ask ourselves, 'Who’s Serving What to Where?' <br> <br> It’s funny—while dining at my favorite restaurant, I found myself having a discussion with my <strong>server</strong>… I said to her, 'Let’s clarify the key difference between programming a server in code and the physical machine we call a server!' She furrowed her brow and replied, 'I asked what you’d like to drink.' <br> <br> For beginners, it’s easy to get lost, and honestly, even for seasoned developers, the term can still be misleading at times.",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/waiting.png",
      "body_2": "<h2>1. The Physical Machine (Hardware/Cloud Server)</h2> <br>A server is a physical machine that provides resources to other computers. It could be housed in a data center or a virtual server provisioned in the cloud. Either way, the server runs 24/7 (or should be) to serve up files, often times to the web—whether on-premises or in massive data centers managed by AWS, Google Cloud, or Microsoft Azure. To deliver content, these physical servers often rely on software like Apache or Nginx, which handle incoming requests and send the appropriate files or data to users. <br><br>  The physical difference between traditional on-prem servers and cloud servers lies in virtualization:<br> <ul><li>&nbsp;&nbsp;&nbsp;&nbsp;On-Premise Servers: Dedicated hardware maintained by a company or data center.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;Cloud Servers: Virtual machines running on shared infrastructure, providing scalability without needing to manage the physical hardware.</li></ul><br>Key Characteristics: <ul><li>&nbsp;&nbsp;&nbsp;&nbsp;It’s hardware with CPU, memory, and storage.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;Both on-premise and cloud servers provide computing power for applications.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;Cloud servers offer elastic scaling, but under the hood, they’re still physical machines.</li></ul><br> It’s funny—I went out for drinks after a volleyball game, and a teammate and I started discussing his confusion about what Node.js is. Man, he’s a strong <strong>server</strong>… I explained to him that, in programming, a server can refer to software that listens for requests and responds to them. This server-side code runs on a physical (or cloud) server and handles everything from delivering web pages to managing databases. A server within a server, so to speak. <strong>Server-Seption!</strong><br><br>",
      "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/top-gun-server.png",
      "body_3": "<h2>2. The Program (Software Server)</h2><br>When we talk about a server in the context of programming, we’re usually referring to a piece of software that listens for and responds to requests. This server-side code runs on the physical machine (or cloud server) and does everything from delivering web pages to managing databases.<br>The software server is essentially the brain behind what the user sees. It can be written in many different programming languages, each with its own strengths and use cases.<br><br><h3>Popular Server-Side Programming Languages:</h3><ul><li><strong>JavaScript</strong> (Node.js): JavaScript can now be used on the server thanks to Node.js, which allows you to write server-side logic in the same language used for front-end development. It's particularly well-suited for handling asynchronous operations, such as processing multiple requests simultaneously.<br>Common Frameworks: Express.js, Nest.js</li><li><strong>Python:</strong> Python is popular for its simplicity and readability, making it great for building servers that need to scale quickly. Python's flexibility makes it ideal for everything from small APIs to large-scale web applications.<br>Common Frameworks: Django, Flask</li><li><strong>Ruby:</strong> Ruby, especially with its Rails framework, is often praised for its simplicity and ability to create fully-featured web applications quickly. Ruby is great for developers who prioritize developer happiness and ease of use.<br>Common Frameworks: Ruby on Rails, Sinatra</li><li><strong>Java:</strong> Java is widely used in enterprise environments for building large, robust applications. It’s known for being highly scalable and stable, which is why it's often found in banking and large corporate systems.<br>Common Frameworks: Spring Boot, Java EE</li><li><strong>PHP:</strong> PHP has been around for a long time and is still a dominant force in the web, especially with content management systems like WordPress. PHP is great for server-side scripting and is widely supported in hosting environments.<br>Common Frameworks: Laravel, Symfony</li><li><strong>C#</strong> (ASP.NET): Microsoft’s C# language is popular for building enterprise applications, particularly within the .NET framework. It’s a powerful language that can handle complex business logic while integrating smoothly with Windows-based environments.<br>Common Frameworks: ASP.NET Core</li> </ul>",
      "image_3": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/seth-served.png",
      "body_4": "It’s funny—just the other day, I was working on deploying my Node.js server to the cloud server I set up on AWS when there was a knock at the door. Lo and behold, a <a href='https://www.uslegalsupport.com/blog/what-is-a-process-server/' target='_blank'>process server</a> was there, delivering some legal documents. As he handed me the papers, he said, 'You know, a server can be both hardware and software, but they both play important roles in the ecosystem.' <br><br>I was taken aback by the coincidence. But he was right—whether it's a physical server in a data center, or the code running on that machine, each one plays a crucial role. <br><br> <h3>The takeaway is this:</h3> <ul> <li>Physical servers (like my restaurant server) handle the hardware side, making sure data gets from point A to point B.</li><li>Software servers (like my volleyball buddy) handle the programming side, receiving requests (serving the ball), processing them (setting it up), and sending responses (spiking the ball).</li><li>And sometimes, other ‘servers’ are there to remind you that not all servers live in the digital world! A good server knows how to handle requests… unlike some servers I know… JK... but seriously. </li> </ul> "
    },
    {
      "id": "007",
      "query": "american-reflections",
      "title": "Reflections on Being American: November 6, 2024",
      "description": "Reflecting on American identity and values in 2024, this personal post explores the complexity of feeling disconnected in a divided nation after the recent election. A candid look at what it means to belong, hope, and navigate a sense of home amid political and cultural shifts.",
      "date": "06 Nov 2024",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/this-is-america.png",
      "keywords": [
        "personal reflection on American identity 2024",
        "disconnected from American values",
        "post-election reflections US politics",
        "feeling disconnected in America 2024",
        "what does it mean to be American 2024",
        "American values and identity post-election"
      ],
      "published_time": "2024-11-06T19:02:51Z",
      "modified_time": "2024-11-06T19:02:51Z",
      "featured": true,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/This-Is-America.m4a",
      "body_1": "I’m sitting at my desk on Wednesday morning, November 6, 2024, sipping coffee and reflecting on what it truly means to be American. And honestly, I’m having a hard time figuring out if I fit in.<br/><br/>I’m not so naive to believe that all, or even most, politicians are selfless champions of the public good. More often, it seems like personal agendas take precedence over the well-being of the people. But here we are, with Donald Trump as our president once again. When the country’s direction seems out of step with my own values, it feels isolating—almost as if the 'home' I know is shifting into something unrecognizable. Seeing someone in a role as symbolic as the presidency who doesn’t reflect any of the values I hold feels like a rejection of those values on a grand scale. <br/><br/>When a leader’s values feel so out of sync with my own, it’s not just disappointing—it’s unsettling. Leaders have a powerful influence, not just through policy but through the behavior they model. When a leader’s values seem questionable, even dismissive of respect or empathy, it sets off a trickle-down effect. The message that sends to their supporters can be frightening. It almost gives permission for certain attitudes and actions that, under other circumstances, might be seen as unacceptable. It's more than just policy, it about identity.",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/it-complicated.png",
      "body_2": "I’m not perfect, <em>shocker...</em> I don’t have all the answers, and I know I have my own flaws, immense at times. But maybe that’s why I find it so troubling. If I can recognize these limitations in myself, I feel that those in positions of power—especially leaders—should strive to set a better example. It’s not about expecting perfection. It’s about modeling values that encourage growth, understanding, and respect, even when it’s challenging.</br/></br/>As I watch this unfold, it’s like witnessing a shift in what’s considered 'acceptable.' When a leader openly mocks adversaries or dismisses entire groups of people, those who support them may feel justified in echoing those behaviors, and the tone of our communities shifts. Over time, this can create a culture where hostility, division, and a lack of respect for others are seen as justifiable—even patriotic. And that, more than any single policy or decision, makes me question if my values will ever align with the direction this country seems to be heading.<br/><br/>Then there’s the phrase people like to throw around: 'Love it or leave it.' But is love really the right word? Honestly, I’m not sure I 'love' my country in the way that word suggests. Love implies a kind of blind loyalty that doesn’t leave much room for criticism or questioning, but relationships are rarely that simple. Like any relationship, my connection to America is complicated. This is where my family lives, where I’ve built my life, where my roots are. Leaving isn’t an easy option, and staying doesn’t mean everything here aligns with who I am.<br/><br/>Life is rarely neat, and nothing ever quite goes as planned. It’s messy, it’s complicated, and maybe that’s how it is with countries too. I don’t know if my version of America will ever be the dominant one, or if people like me—who value empathy, progress, and inclusion—will ever find ourselves fully reflected in this nation. But despite all the frustrations, it’s hard to just give up on something that feels like it should be part of who I am.",
      "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/the-bottom.png",
      "body_3": "Maybe this is less about love and more about a hope for something better, a belief that there’s still room to build and change, even if the road doesn't seem clear. But at the same time, I wonder—how long can I feel like a stranger in my own country before that hope starts to fade?"
    },
    {
      "id": "008",
      "query": "closures-javascript",
      "title": "Closure on the Concept of JavaScript Closures",
      "description": "Learn about JavaScript closures. This post covers what closures are, provides clear examples, breaks down complex concepts, and explains why closures are an essential part of any JavaScript developer's toolkit.",
      "date": "07 Jan 2025",
      "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/closers-cover.png",
      "keywords": ["closures", "javascript", "scope"],
      "published_time": "2025-01-07T15:32:05Z",
      "modified_time": "2025-01-07T15:32:05Z",
      "featured": false,
      "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/closure-song.mp3",
      "body_1": "I was recently in a situation where I was talking to a senior developer, and he was asking me questions about JavaScript to gauge my knowledge. Before this conversation, I felt confident in my JavaScript knowledge. After that conversation, I felt deflated. I realized I still had a lot of work to do. My goal is to become comfortable with the aspects of JavaScript where I fell short during that conversation. To that end, I want to bring clarity to the JavaScript concept of closures. <br><br><h2>Understanding Closures </h2>Closures are tricky, but they become easier to understand when broken down. A closure happens when a function can <strong>remember</strong> and access variables from its outer <a href='https://developer.mozilla.org/en-US/docs/Glossary/Scope'>scope</a>, even after that outer scope has finished executing. This unique behavior allows inner functions to retain access to variables defined in an enclosing function.<br><br><strong>Key takeaway:</strong> Closures enable functions to remember and access variables from their surrounding context, even after that context has finished executing. <br><br><h2>Example of a Closure</h2>Here’s a simple example to illustrate how closures work. Create an HTML file, link a script.js page and copy this code so you can see the console output.<br><br><em>Refer back to this block throughout the article</em><<pre class='language-js'><code class='language-js'>function outerFunction(outerVariable) {\n return function innerFunction(innerVariable) {\n   console.log(`Outer Variable: ${outerVariable}`);\n   console.log(`Inner Variable: ${innerVariable}`); \n }; \n } \n \n const closureFunc = outerFunction('outside'); \n closureFunc('inside');</code></pre> <br><br><strong>Explanation:</strong><br><ul><li><code>outerFunction</code> takes a <a href='https://www.geeksforgeeks.org/javascript-function-parameters/'>parameter</a> <code>outerVariable</code></li><li>It returns <code>innerFunction</code>, which itself takes a parameter <code>innerVariable</code>.</li><li> <code> innerFunction</code> logs both <code>outerVariable</code> and <code>innerVariable.</code></li><li>Even after <code>outerFunction</code> has finished executing, <code>innerFunction</code> retains access to outerVariable due to the closure.</li></ul>",
      "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/arnald-closers.png",
      "body_2": "<h2>Breaking Down the Code</h2>Reference code block above<h4>Step 1: Defining the Outer Function</h4><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>function outerFunction(outerVariable) </code></span> <br><code>outerFunction</code> is defined with one parameter, <code>outerVariable.</code><br><br><h4>Step 2: Returning the Inner Function</h4><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>return function innerFunction(innerVariable)</code></span><br>Instead of executing <code>innerFunction</code>, <code>outerFunction</code> returns it.<br>The returned <code>innerFunction</code> retains access to <code>outerVariable</code>.<br><br><h4>Step 3: Parameters in Scope</h4><code>outerVariable</code> belongs to <code>outerFunction</code>.<br><br><h4>Step 4: Logging Inside the Inner Function</h4><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>console.log(`Outer Variable: ${outerVariable}`);</code></span><br><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>console.log(`Inner Variable: ${innerVariable}`);</code></span><br><code>innerFunction</code> logs both <code>outerVariable</code> and <code>innerVariable</code>, demonstrating how closures work.<br><br> An outer function defines a variable and returns an inner function. When innerFunction is called later, it still has access to outerVariable from the outer function's scope, even though the outer function has finished executing.",
      "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/How-does-closers.png",
      "body_3": "<h2>How the Function Calls Work</h2><h4>1. Calling outerFunction</h4><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>const closureFunc = outerFunction('outside');</code></span><br><strong>What happens:</strong><br><ul style='padding-left: 40px;'><li><code>outerFunction</code> is called with the argument 'outside'.</li><li>It logs 'outside'.</li><li>It returns <code>innerFunction</code>, which gets stored in <code>closureFunc</code>.</li></ul><h4>2. Calling innerFunction via closureFunc</h4><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>closureFunc('inside');</code></span><br><strong>What happens:</strong><ul style='padding-left: 40px;'><li><code>closureFunc</code> is invoked with the argument 'inside'.</li><li>innerFunction logs:<br><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>Outer Variable: outside</code></span><br><span style='background-color: rgb(209, 209, 209); padding: 5px;'><code>Inner Variable: inside&nbsp;</code></span></li><li>Even though <code>outerFunction</code> has completed, <code>innerFunction</code> still has access to <code>outerVariable</code> because of the closure.</li></ul><br><br> <h3>closureFunc is the returned innerFunction(), which remembers the outerFunction argument (in this case the string 'outside') and takes a new argument for itself.. in this case ('inside')</h3><br><ol><li>closureFunc is the returned innerFunction.</li><li>It 'remembers' the outerFunction argument (via the closure).</li><li>It also accepts a new argument specifically for innerFunction.</li></ol>",
      "image_3": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/think-mcfly-closures.png ",
      "body_4": "<h2>Common Misunderstandings</h2>Why doesn’t closureFunc('inside') invoke outerFunction?<br>It might seem like calling closureFunc should somehow trigger outerFunction, but here’s the key point:<ul style='padding-left: 40px;'><li>closureFunc is just a reference to innerFunction.</li><li>outerFunction is no longer involved after returning innerFunction.</li></ul>Even though outerFunction has finished executing, its variables remain accessible to innerFunction because of the closure.<br><br><h2>Why Closures Matter</h2>Closures are powerful because they allow:<br><ul style='padding-left: 40px;'><li>Data encapsulation: Variables can be kept private within a function.</li><li>Function factories: You can create functions with preset configurations.</li><li>Maintaining state: Closures help manage state in asynchronous operations.</li></ul><br><h2>Final Thoughts</h2>Closures are a fundamental concept in JavaScript. While they may seem confusing initially, understanding how they work will deepen your knowledge of JavaScript functions and scope. Closures are widely used in callbacks, function factories, and state management in asynchronous code.<br><br>With practice, closures will become a natural and powerful tool in your JavaScript toolkit."
    }
  ]
}
