{
    "key": [
        {
            "id": "000",
            "query": "",
            "title": "",
            "description": "",
            "date": "",
            "article_image": "",
            "keywords": [],
            "published_time": "",
            "modified_time": "",
            "featured": true,
            "vibe_audio": "",
            "body_1": "",
            "image_1": "",
            "video_1": "",
            "body_2": "",
            "image_2": "",
            "video_2": "",
            "body_3": ""
        }
    ],
    "posts": [
        {
            "id": "001",
            "query": "hello-world",
            "date": "27 Jun 2024",
            "title": "Hello World: Starting a Blog, Next.JS, and AWS Amplify",
            "description": "Welcome to my blog! In this first post, I share my journey of starting a blog using Next.js and AWS Amplify. I discuss the robust features of Next.js, the ease of hosting with AWS Amplify, and my plans for future enhancements like adding a database. Join me as I dive deep into these technologies and share my learnings as a developer.",
            "article_image": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/wiz-oz.png",
            "keywords": [
                "Dev",
                "Next.js",
                "AWS Amplify",
                "Dynamic Routing"
            ],
            "published_time": "2024-06-27T16:24:36Z",
            "modified_time": "2024-06-27T16:24:36Z",
            "featured": true,
            "vibe_audio": "https://latestartbucket.s3.us-east-2.amazonaws.com/audio/hello.mp3",
            "image_1": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/hello-world.png",
            "video_1": "",
            "body_1": "Welcome to my blog, my friends and randos from the interwebs! This is my first post, and I'm excited to share, well... whatever this is with you. I&apos;ve decided to start this blog as a way to improve my skills in Next.js and Amazon Web Services (AWS). These technologies are not only powerful but also offer exciting opportunities for future projects and career growth. To be quite honest, it has been such a learning experience, and I&apos;ve had a great time building it. I&apos;ve also just been looking for a place to try out some different things. After my <a href='https://www.youtube.com/@YourDadSucksGaming' target='_blank'>failed attempt to be a video game YouTuber</a>. I figured blogging might be fun, and maybe not so embarrassing... but it will probably turn out to be as embarrassing. Hopefully you enjoy this journey with me as much as I enjoyed building it. </br></br> <h2>Why Next.js and AWS Amplify?</h2></br> I chose Next.js for its honestly bad ass features and flexibility, especially when it comes to server-side rendering and static site generation. I&apos;ve messed around with Next.js a bit, but this gives me an excuse to dive deeper into it. AWS Amplify, on the other hand, makes hosting and managing this site surprisingly easy. One of the coolest features is the seamless integration with GitHub. Every time I update my repository, the changes are automatically deployed to my site! Coming from PHP and Apache servers at my job, this is seriously a breath of fresh air. Because of this, I&apos;m not currently using JSON file to render all of this information to you. The goal is to ultimately add a database, but in due time.",
            "body_2": "<h2>Dynamic Routing and Other Issues</h2></br><h4 >Warning: DEV jargon ahead</h4></br>One of the significant hurdles was figuring out dynamic routing. Initially, I tried using query strings in the URL to render this very blog page. This method worked fine with Vercel hosting, but I encountered issues when switching to AWS. After some trial and error, I managed to implement <a href='https://nextjs.org/docs/pages/building-your-application/routing/dynamic-routes' target='_blank'>dynamic routing</a>, and everything started coming together. I love how clean the URL looks now. Just look at it: <em>https://latestartdev.com/posts/hello-world</em>. Compared to query strings, you wouldn't even know this URL is dynamic!</br></br>Another challenge was dynamically rendering metadata for each blog post. Ensuring that each page had the correct metadata for SEO purposes was tricky but essential. Using the Link tag that Next.js provides out of the box passes parameters so easily. I created a dynamic page and was able to create dynamic URLs using template literals in the `src` part of the Link tag. I'm getting into the weeds here, so I'll probably dedicate a whole post to this topic.</br></br>I also found the Next.js Image tag to be a bit confusing... even still. It's a powerful tool for optimizing images, but getting the configuration right took some time and experimentation. I am using an out-of-date method called <em>&apos;layout&apos;</em>. When I use <em>layout=&quot;responsive&quot;</em>, the image just works. Out of frustration, I have decided to just use this method. Why Next.js?? Why are you taking away this great feature!",
            "image_2": "https://latestartbucket.s3.us-east-2.amazonaws.com/image/waiting.png",
            "video_2": "",
            "body_3": "<h2>What’s Next... js?</h2></br>Looking ahead, my next step is to connect the blog to a database. I'm planning to use Amazon DynamoDB to keep everything within the AWS ecosystem. This will allow me to manage and serve blog posts more efficiently.</br></br>Through this blog, I’ll be sharing my learnings as a developer, and tips and tricks I pick up along the way, and whatever else I feel like. Whether you're just starting your journey in the tech world or you're changing your career, or whatever, I hope my experiences can provide some value. Starting something new can be daunting, but when things start to come together, there's no better feeling. I'm looking forward to exploring creative ways to create posts and sharing my progress.</br></br>You still there? Didn’t think so…. You were never there anyways…. Stay tuned for more updates!"
        }
    ]
}